# StructuralAttachmentTopReferencedend Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralAttachmentTopReferencedend Property
ParameterTypeId Class See Also
---
"Top Attachment Referenced End"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralAttachmentTopReferencedend { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralAttachmentTopReferencedend As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralAttachmentTopReferencedend {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace